cf/DataProcessors/РабочийСтол.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<DataProcessor>
		<Properties>
			<Name>РабочийСтол</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

cf/AccumulationRegisters/Заявки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<AccumulationRegister>
		<Properties>
			<Name>Заявки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Заказчики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заявки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf/InformationRegisters/ПробегАвто.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ПробегАвто</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пробег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Авто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Авто</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/DataProcessors/РабочийСтол/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОткрытьСписокЗаявок(Команда)
	
	Форма=ПолучитьФорму("Документ.Заявки.ФормаСписка");
	Форма.Открыть();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокЗакрытияЗаявок(Команда)
	
	Форма=ПолучитьФорму("Документ.ЗакрытиеЗаявок.ФормаСписка");
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбработкуДолги(Команда)
		
	Форма=ПолучитьФорму("Обработка.обДолги.Форма");
	Форма.Открыть();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбработкуЗаработок(Команда)
	
	Форма=ПолучитьФорму("Обработка.обЗаработок.Форма");
	Форма.Открыть();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбработкуВыполненныеРаботы(Команда)
	
	Форма=ПолучитьФорму("Обработка.обВыполненныеРаботы.Форма");
	Форма.Открыть();

КонецПроцедуры

&НаСервере
Процедура ОбновитьСуммуДолговНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ЗаявкиОстатки.СуммаОстаток) КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.Заявки.Остатки КАК ЗаявкиОстатки";
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() тогда
		СуммаДолга = ВыборкаДетальныеЗаписи.СуммаОстаток	
	Иначе		
		СуммаДолга = 0;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСуммуДолгов(Команда)
	ОбновитьСуммуДолговНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьСуммуДолговНаСервере();
	ОбновитьДанныеПоАвтоНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеПоАвтоНаСервере()
	
	АвтоПоУмолчанию = АвтоВызовСервера.ПолучитьАвтоПоУмолчанию();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПробегАвтоСрезПоследних.Период КАК Период,
		|	ПробегАвтоСрезПоследних.Авто КАК Авто,
		|	ПробегАвтоСрезПоследних.Пробег КАК Пробег
		|ИЗ
		|	РегистрСведений.ПробегАвто.СрезПоследних КАК ПробегАвтоСрезПоследних
		|ГДЕ
		|	ПробегАвтоСрезПоследних.Авто = &АвтоПоУмолчанию";
	
	Запрос.УстановитьПараметр("АвтоПоУмолчанию", АвтоПоУмолчанию);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		ПробегДата 	= ВыборкаДетальныеЗаписи.Период;
		Пробег 		= ВыборкаДетальныеЗаписи.Пробег;
	Иначе
		
	КонецЕсли;
	
	 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПробег(Команда)
	ОбновитьДанныеПоАвтоНаСервере();
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиНаСервере()

	Константы.АвтоПоУмолчанию.Установить(АвтоПоУмолчанию);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	СохранитьНастройкиНаСервере();
КонецПроцедуры
